Autodesk.Revit.DB.ExportLayerTable.GetExportLayerTableIteratorInternal
Returns a LayerTableIterator to the pattern table.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator( KeyValuePair(ExportLayerKey^,ExportLayerInfo^) ) object that can be used to iterate through key-value pairs in the collection.